# Pandas

In [1]:
import pandas as pd

In [2]:
pwd ## comando en linux en que directorio estoy

'/Users/kevinjimenez/Documents/desarrollo/personal/github/python'

In [4]:
ls ## lista files del directorio donde estoy

README.md                               Untitled.ipynb
Screen Shot 2021-03-08 at 12.32.19.png  machine-learning.md
Screen Shot 2021-03-08 at 12.36.54.png  numpy.ipynb
Screen Shot 2021-03-08 at 12.37.08.png  personas.csv

In [5]:
dataframe = pd.read_csv('personas.csv') ## leo un csv

In [10]:
dataframe

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

In [8]:
dataframe.describe() ## informacion adicional del csv

            EDAD       SALARIO
count   5.000000      5.000000
mean   39.600000  32400.000000
std    10.968136  15208.550227
min    25.000000  15000.000000
25%    34.000000  20000.000000
50%    40.000000  32000.000000
75%    45.000000  45000.000000
max    54.000000  50000.000000

In [13]:
dataframe['NOMBRE'] ## me extrae la informacion de la columna NOMBRES

0    ANTONIO
1       LUIS
2       ROSA
3      PEDRO
4      MARIA
Name: NOMBRE, dtype: object

In [16]:
dataframe['NOMBRE'][1] ## me obtiene el valor en la posicion 0 (indice)

'LUIS'

In [18]:
dataframe[['NOMBRE', 'APELLIDOS']]  ## para obtener mas columnas

    NOMBRE          APELLIDOS
0  ANTONIO        PEREZ GOMEZ
1     LUIS  RODRIGUEZ VAZQUEZ
2     ROSA     MARTINEZ LOPEZ
3    PEDRO     SILVA GONZALEZ
4    MARIA         DIAZ LOPEZ

In [20]:
dataframe['SALARIO']  > 30000 ## FILTRO EN LOS SALARIOS

0    False
1     True
2    False
3     True
4     True
Name: SALARIO, dtype: bool

In [22]:
filtro_dataframe = dataframe['SALARIO'] > 30000 ## al igual q en numpy, array se puede realizar filtros

In [23]:
dataframe_filtro = dataframe[filtro_dataframe]

In [25]:
dataframe_filtro

  NOMBRE          APELLIDOS  EDAD  SALARIO
1   LUIS  RODRIGUEZ VAZQUEZ    45    45000
3  PEDRO     SILVA GONZALEZ    54    50000
4  MARIA         DIAZ LOPEZ    40    32000

### Convertir un dataframe (Pandas) a array

In [26]:
dataframe_filtro.values

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [27]:
array = dataframe_filtro.values

In [28]:
array

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [29]:
array[0,2]

45